cask_args appdir: '~/Applications'

tap "azure/draft"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jenkins-x/jx"

brew 'mas'

# compilers/env/sdk managers
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'nvm'
brew 'rbenv'
brew 'go'
brew 'cocoapods'
brew 'erlang'
brew 'elixir'
cask 'dotnet-sdk'

# important apps
cask 'caffeine'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'sublime-text'

# password managers/security
cask '1password'
cask 'dropbox'
cask 'gpg-suite'
cask 'keybase'
brew 'blackbox'
brew 'cfssl'
brew 'openssl'
brew 'pwgen'

# ides
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
mas 'Xcode', id: 497799835

# dbs and infra
cask 'postgres', { appdir: '/Applications' }
mas 'SQLPro for Postgres', id: 976140091
brew 'postgres'
cask 'dbvisualizer'
cask 'mongodb-compass-community'
brew 'sqlite'
cask 'docker-edge'
brew 'ansible'
brew 'awscli'
brew 'azure-cli'
brew 'draft'
cask 'google-cloud-sdk'
brew 'jx'
cask 'kitematic'
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
cask 'minikube'
brew 'packer'
cask 'powershell'
brew 's3cmd'
brew 'terraform'
brew 'terraform-docs'
cask 'vagrant'
cask 'virtualbox'

# misc apps
cask 'microsoft-office'
cask 'cyberduck'
cask 'owasp-zap'
cask 'react-native-debugger'
cask 'slack'
cask 'wireshark'
cask 'zoomus'
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

# dev
brew 'adr-tools'
brew 'bash-completion'
brew 'cloc'
brew 'cntlm'
brew 'ctop'
brew 'curl'
brew 'dos2unix'
brew 'gcc'
brew 'git'
brew 'jq'
brew 'magic-wormhole'
brew 'pngcrush'
cask 'postman'
brew 'protobuf'
brew 'telnet'
brew 'tmux'
brew 'unrar'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'

