
cask_args appdir: '/Applications'

tap "azure/draft"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jenkins-x/jx"
tap "gjbae1212/gossm"
tap 'isen-ng/dotnet-sdk-versions'

brew 'mas'

# compilers/env/sdk managers
brew 'nuget'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'fnm'
brew 'rbenv'
brew 'go'
brew 'ghc'
brew 'cocoapods'
brew 'erlang'
brew 'elixir'
brew 'mono-libgdiplus'
cask 'dotnet-sdk'
cask 'dotnet-sdk2-2-400'
brew 'dep'
brew 'rustup'

# important apps
cask 'caffeine'
cask 'flycut'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'sublime-text'

# password managers/security
cask '1password'
cask 'dropbox'
cask 'gpg-suite'
cask 'keybase'
brew 'blackbox'
brew 'cfssl'
brew 'openssl'
brew 'pwgen'
brew 'talisman'

# ides
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
mas 'Xcode', id: 497799835

# dbs and infra
cask 'postgres', { appdir: '/Applications' }
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'SQLPro for Postgres', id: 976140091
brew 'postgres'
cask 'dbvisualizer'
cask 'mongodb-compass-community'
brew 'circleci'
brew 'sqlite'
cask 'docker'
brew 'dive'
brew 'ansible'
brew 'awscli'
brew 'azure-cli'
brew 'draft'
cask 'google-cloud-sdk'
brew 'gossm'
brew 'jx'
brew 'kind'
cask 'kitematic'
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
cask 'minikube'
cask 'nosql-workbench'
brew 'packer'
cask 'powershell'
brew 's3cmd'
brew 'terraform'
brew 'terraform-docs'
brew 'terragrunt'
brew 'tfsec'
cask 'vagrant'
cask 'virtualbox'

# misc apps
cask 'microsoft-office'
cask 'cyberduck'
cask 'owasp-zap'
cask 'react-native-debugger'
cask 'snipaste'
cask 'slack'
cask 'steam'
cask 'zoom'
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541

# dev
brew 'adr-tools'
brew 'bash-completion'
brew 'bfg'
brew 'cloc'
brew 'cntlm'
brew 'ctop'
brew 'curl'
brew 'dos2unix'
brew 'flow'
brew 'gcc'
brew 'git'
brew 'jq'
brew 'ipcalc'
brew 'magic-wormhole'
cask 'microsoft-teams'
brew 'opa'
brew 'pngcrush'
cask 'postman'
brew 'protobuf'
brew 'shellcheck'
brew 'swagger-codegen'
cask 'teamviewer'
brew 'telnet'
brew 'tldr'
brew 'tmux'
brew 'unrar'
brew 'watch'
brew 'watchman'
brew 'wget'
cask 'wireshark'
brew 'yarn'
brew 'zlib'
